src/AccumulationRegisters/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Сертификаты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Клиент владелец сертификата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СрокДействияПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СрокДействияПодарочныхСертификатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезОграниченияСрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОграничениемНаДату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПослеПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПартииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПартииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ЛицевыеСчетаИСертификатыСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить сертификат по штрихкоду проверить его пригодность
//
// Параметры:
//  НомерШтрихкода		 - 	 - 
//  ОписаниеРезультата	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеВсехСертификатовПоШтрихкодуИлиСерииПроверитьПригодность(
		Знач ДанныеВвода, 
		Знач ВводСосканера,
		Контрагент,
		СтруктурнаяЕдиница) Экспорт
	
	ДанныеСертификатаПоШт = ПолучитьДанныеСертификатаПоШтрихкоду(ДанныеВвода, Контрагент, СтруктурнаяЕдиница);
		
    ДанныеСертификатов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСертификатаПоШт) 
		И ВводСосканера = Ложь Тогда		
		ДанныеСертификатов = ПолучитьДанныеВсехСертификатовПоНаименованиюСерии(ДанныеВвода, СтруктурнаяЕдиница, Контрагент);
	Иначе	
		ДанныеСертификатов.Добавить(ДанныеСертификатаПоШт);		
	КонецЕсли;
	
	Индекс = 0;
	
	Для Каждого ДанныеСерт ИЗ ДанныеСертификатов Цикл
		
		ДанныеСертификатов[Индекс] = ВыполнитьПроверкуДанныхСертификата(ДанныеСерт, ВводСосканера);
		Индекс = Индекс + 1;
		
	КонецЦикла; 
	 
	Возврат ДанныеСертификатов;
	
КонецФункции

// Функция - Получить данные сертификата по штрихкоду
//
// Параметры:
//  Штрихкод - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСертификатаПоШтрихкоду(Знач Штрихкод, Контрагент, СтруктурнаяЕдиница) Экспорт
	
	ДанныеШтрихкода = МенеджерОборудованияВызовСервера.ПолучитьДанныеШтрихКода(Штрихкод, Ложь);

	Если СтрНачинаетсяС(ДанныеШтрихкода.ТипДанных, "СЕРТИФИКАТ") Тогда
		
		Возврат ПолучитьДанныеСертификата(ДанныеШтрихкода.Сертификат, ДанныеШтрихкода.ПартияСертификата, СтруктурнаяЕдиница, Контрагент);
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Получить данные сертификата
//
// Параметры:
//  Сертификат	 - 	 - 
//  Партия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеСертификата(
		Сертификат, Партия, СтруктурнаяЕдиница = Неопределено, Контрагент = Неопределено) Экспорт
	         	
	СтруктуруОтвета = Новый Структура("
	|Сертификат,
	|Партия,
	|Продан,
	|ОстатокСуммы,
	|ОстатокКоличества,
	|Представление,
	|Штрихкод,
	|ТребуетПодтверждения,
	|ДатаПродажи,
	|ДатаОкончанияСрокаДействия,
	|Покупатель,
	|ДатаОткрытия");
	
	СтруктуруОтвета.Сертификат           = Сертификат; 
	СтруктуруОтвета.Партия               = Партия; 
	СтруктуруОтвета.Продан               = Ложь;
	СтруктуруОтвета.ОстатокСуммы         = 0;	
	СтруктуруОтвета.ОстатокКоличества    = 0;
	СтруктуруОтвета.Штрихкод             = ПолучитьШтрихкодСертификата(Сертификат, Партия);
	СтруктуруОтвета.Представление        = ПолучитьПредставлениеНаименованияСертификата(Сертификат, Партия, СтруктуруОтвета.Штрихкод );
	СтруктуруОтвета.ТребуетПодтверждения = ЗначениеЗаполнено(СтруктуруОтвета.Штрихкод);
	
    ДанныеСертификата = ПолучитьДанныеДляАктивногоСертификата(Сертификат, Партия, СтруктурнаяЕдиница, Контрагент);
	
	Для Каждого СтрокаДанных Из ДанныеСертификата Цикл
		
		СтруктуруОтвета.ДатаПродажи                = СтрокаДанных.ДатаПродажи;
		СтруктуруОтвета.ДатаОкончанияСрокаДействия = СтрокаДанных.ДатаОкончанияСрокаДействия;
		СтруктуруОтвета.Покупатель			   	   = Контрагент;		
		СтруктуруОтвета.Продан                     = Истина;
		СтруктуруОтвета.ОстатокСуммы               = СтрокаДанных.Сумма;
		СтруктуруОтвета.ОстатокКоличества          = СтрокаДанных.Количество;
		СтруктуруОтвета.ДатаОкончанияСрокаДействия = СтрокаДанных.ДатаОкончанияСрокаДействия;
		
	КонецЦикла;
	
	Возврат СтруктуруОтвета;
	
КонецФункции

// Функция - Получить признак продажи сертификата
//
// Параметры:
//  Сертификат	 - 	 - 
//  Партия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеДляАктивногоСертификата(Сертификат, Партия, СтруктурнаяЕдиница, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Сертификат КАК Сертификат,
	|	ВЫБОР
	|		КОГДА НЕ ВложенныйЗапрос.Сертификат.СертификатМногоразовоеИспользование
	|			ТОГДА ВложенныйЗапрос.Номинал
	|		ИНАЧЕ ВложенныйЗапрос.СуммаОборот
	|	КОНЕЦ КАК Номинал,
	|	ВложенныйЗапрос.СуммаОборот КАК Сумма,
	|	ВложенныйЗапрос.КоличествоОборот КАК Количество,
	|	ВложенныйЗапрос.ДатаПродажи КАК ДатаПродажи,
	|	ВложенныйЗапрос.ДатаОкончанияСрокаДействия КАК ДатаОкончанияСрокаДействия
	|ИЗ
	|	(ВЫБРАТЬ
	|		СертификатыОстаткиИОбороты.Сертификат КАК Сертификат,
	|		СертификатыОстаткиИОбороты.Сертификат.Номинал КАК Номинал,
	|		СУММА(СертификатыОстаткиИОбороты.СуммаОборот) КАК СуммаОборот,
	|		СУММА(СертификатыОстаткиИОбороты.КоличествоОборот) КАК КоличествоОборот,
	|		ДатаПродажи.Период КАК ДатаПродажи,
	|		ВЫБОР
	|			КОГДА СертификатыОстаткиИОбороты.Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|				ТОГДА СертификатыОстаткиИОбороты.Сертификат.ДатаОкончанияДействия
	|			КОГДА СертификатыОстаткиИОбороты.Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)
	|				ТОГДА ВЫБОР
	|						КОГДА СертификатыОстаткиИОбороты.Сертификат.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДатаПродажи.Период, МЕСЯЦ, СертификатыОстаткиИОбороты.Сертификат.КоличествоПериодовДействия)
	|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ДатаПродажи.Период, ДЕНЬ, 1)
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ КАК ДатаОкончанияСрокаДействия
	|	ИЗ
	|		РегистрНакопления.Сертификаты.ОстаткиИОбороты(
	|				,
	|				,
	|				Авто,
	|				,
	|				Сертификат = &Сертификат
	|					И СерийныйНомер = &СерийныйНомер
	|					И ВЫБОР
	|						КОГДА Сертификат.ЭтоИменнойСертификат
	|							ТОГДА Контрагент = &Контрагент
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|							ТОГДА &Дата <= Сертификат.ДатаОкончанияДействия
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СертификатыОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СертификатыОбороты.Период КАК Период,
	|				СертификатыОбороты.Сертификат КАК Сертификат,
	|				СертификатыОбороты.СерийныйНомер КАК СерийныйНомер
	|			ИЗ
	|				РегистрНакопления.Сертификаты.Обороты(
	|						,
	|						,
	|						День,
	|						ВЫБОР
	|								КОГДА Сертификат.ЭтоИменнойСертификат
	|									ТОГДА Контрагент = &Контрагент
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|							И Сертификат = &Сертификат
	|							И СерийныйНомер = &СерийныйНомер
	|							И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК СертификатыОбороты
	|			ГДЕ
	|				СертификатыОбороты.КоличествоПриход > 0) КАК ДатаПродажи
	|			ПО СертификатыОстаткиИОбороты.Сертификат = ДатаПродажи.Сертификат
	|				И СертификатыОстаткиИОбороты.СерийныйНомер = ДатаПродажи.СерийныйНомер
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА СертификатыОстаткиИОбороты.Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|					ТОГДА СертификатыОстаткиИОбороты.Сертификат.ДатаОкончанияДействия > &Дата
	|				КОГДА СертификатыОстаткиИОбороты.Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)
	|					ТОГДА ВЫБОР
	|							КОГДА СертификатыОстаткиИОбороты.Сертификат.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|								ТОГДА ДОБАВИТЬКДАТЕ(ДатаПродажи.Период, МЕСЯЦ, СертификатыОстаткиИОбороты.Сертификат.КоличествоПериодовДействия)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(ДатаПродажи.Период, ДЕНЬ, 1)
	|						КОНЕЦ > &Дата
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СертификатыОстаткиИОбороты.Сертификат,
	|		СертификатыОстаткиИОбороты.Сертификат.Номинал,
	|		ДатаПродажи.Период,
	|		ВЫБОР
	|			КОГДА СертификатыОстаткиИОбороты.Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|				ТОГДА СертификатыОстаткиИОбороты.Сертификат.ДатаОкончанияДействия
	|			КОГДА СертификатыОстаткиИОбороты.Сертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)
	|				ТОГДА ВЫБОР
	|						КОГДА СертификатыОстаткиИОбороты.Сертификат.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДатаПродажи.Период, МЕСЯЦ, СертификатыОстаткиИОбороты.Сертификат.КоличествоПериодовДействия)
	|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ДатаПродажи.Период, ДЕНЬ, 1)
	|					КОНЕЦ
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.КоличествоОборот > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сертификат";
		
	Запрос.УстановитьПараметр("Дата"              , ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент"        , Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сертификат"        , Сертификат);
	Запрос.УстановитьПараметр("СерийныйНомер"     , Партия);

	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;	
		   
КонецФункции

// Функция - Получить штрихкод сертификата
//
// Параметры:
//  Сертификат	 - 	 - 
//  Партия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьШтрихкодСертификата(Сертификат, Партия) Экспорт
	
	Возврат РегистрыСведений.Штрихкоды.ПоулчитьШтрихкодПоОбъекту(Сертификат, Партия);
	
КонецФункции

#Область ПредставлениеДанных

// Функция - Получить представление наименования сертификата
//
// Параметры:
//  Сертификат	 - 	 - 
//  Партия		 - 	 - 
//  Штрихкод	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеНаименованияСертификата(Сертификат, Партия, Штрихкод = Неопределено, ОстатокСуммы = Неопределено) Экспорт
	
	Представление = "";
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Штрихкод = РегистрыСведений.Штрихкоды.ПоулчитьШтрихкодПоОбъекту(Сертификат, Партия);	
	КонецЕсли;
   
    Представление = ?(ЗначениеЗаполнено(Штрихкод), Штрихкод + ", ", "") + Строка(Сертификат);
	
	Если ЗначениеЗаполнено(ОстатокСуммы) Тогда
		
		Представление = Представление + ", остаток: " + ОстатокСуммы + " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Функция - Получить данные сертификата по наименованию серии
//
// Параметры:
//  НаименованиеСерии	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДанныеВсехСертификатовПоНаименованиюСерии(Знач НаименованиеСерии, СтруктурнаяЕдиница, Контрагент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|ГДЕ
	|	ПартииНоменклатуры.Наименование = &Наименование
	|	И ПартииНоменклатуры.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеСерии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сертификаты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		НайденнаяСерия = ВЫборка.Ссылка;
		
		Если ЗначениеЗаполнено(НайденнаяСерия) 
			И ТипЗнч(НайденнаяСерия.Владелец) = Тип("СправочникСсылка.Номенклатура")
			И НайденнаяСерия.Владелец.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
			
			Сертификаты.Добавить(ПолучитьДанныеСертификата(НайденнаяСерия.Владелец, НайденнаяСерия, СтруктурнаяЕдиница, Контрагент));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Сертификаты;
	
КонецФункции 

// Функция - Выполнить проверку данных сертификата
//
// Параметры:
//  ДанныеСертификата	 - 	 - 
//  ВводСосканера		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьПроверкуДанныхСертификата(ДанныеСертификата, ВводСосканера) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеСертификата) Тогда
		
		ДанныеСертификата                  = Новый Структура("Использовать,ОписаниеПроверки,Подтвержден");		
		ДанныеСертификата.ОписаниеПроверки = "По данному штрихкоду или серии сертификат не найден";
		ДанныеСертификата.Использовать     = Ложь;
		ДанныеСертификата.Подтвержден      = Ложь;

		Возврат ДанныеСертификата;
		
	Иначе
		
		ДанныеСертификата.Вставить("ОписаниеПроверки", Неопределено);
		ДанныеСертификата.Вставить("Использовать"    , Истина);	
		ДанныеСертификата.Вставить("Подтвержден"     , ?(ВводСосканера = Истина ИЛИ ДанныеСертификата.ТребуетПодтверждения = Ложь, Истина, Ложь));	
		
	КонецЕсли;
		
	Если ДанныеСертификата.Продан = Ложь Тогда
		
		ДанныеСертификата.ОписаниеПроверки = "Сертификат № " + ДанныеСертификата.Партия + " не реализован!";
        ДанныеСертификата.Использовать     = Ложь;
		
	ИначеЕсли ДанныеСертификата.ОстатокСуммы <= 0 Тогда
		
		ДанныеСертификата.ОписаниеПроверки = "Сертификат № " + СокрЛП(ДанныеСертификата.Партия) + ", остаток 0" 
		+ ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
	    ДанныеСертификата.Использовать = Ложь;
				
	КонецЕсли;
	
    Возврат ДанныеСертификата;

КонецФункции

#КонецОбласти

#КонецОбласти
